app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.create(task_params)
---
INSERT INTO "tasks" ("user_id", "created_at", "updated_at", "title", "details", "image") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["created_at", "2023-03-25 00:18:01.562141"], ["updated_at", "2023-03-25 00:18:01.562141"], ["title", "Flex"], ["details", nil], ["image", nil]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "title" = ? WHERE "tasks"."id" = ?  [["updated_at", "2023-03-24 06:50:25.865655"], ["title", "kdkfdk"], ["id", 1]]